#coding:utf8

import random

def create_name(num):
    list_f_name = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许', '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章', '云', '苏', '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳', '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常', '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹', '姚', '邵', '湛', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞', '熊', '纪', '舒', '屈', '项', '祝', '董', '梁', '杜', '阮', '蓝', '闵', '席', '季', '麻', '强', '贾', '路', '娄', '危']
    list_l_name = ['娜', '希', '珠', '翠', '雅', '芝', '萍', '霭', '柔', '竹', '荔', '枝', '思', '嘉', '琼', '妍', '茜', '颖', '云', '莲', '真', '环', '荣', '莺', '艳', '凡', '琼', '勤', '珍', '贞', '莉', '希', '宁', '亚', '宜', '可', '晴', '涵', '洁', '湘', '恬', '允', '妍', '柔', '音', '妤', '语', '郁', '诗', '宁', '沫', '莲', '真', '霄', '妮', '翎', '羽', '霏', '雪', '佳', '智', '素', '伊', '婕', '媛', '咏', '瞳', '梦', '芩', '霏', '颖', '飘', '晴', '涵', '洁', '湘', '恬', '允', '妍', '柔', '音', '妤', '语', '郁', '诗', '宁', '孝', '妮', '翎', '羽', '雪', '佳', '智', '素', '伊', '婕', '媛', '咏', '瞳', '梦', '芩', '苑', '星', '绚', '若', '珞', '悠', '艾', '桂', '娣', '叶', '璧', '璐', '娅', '琦', '妍', '茜', '秋', '珊', '莎', '锦', '琬', '茗', '羽', '伊', '宁', '黛', '青', '婷', '娴', '瑾', '露', '瑶', '婵', '雁', '蓓', '纨', '仪', '冰', '爽', '昭', '寒', '聪', '婷', '丹', '蓉', '眉', '君', '琴', '蕊', '薇', '菁', '梦', '岚', '苑', '婕', '馨', '纯', '毓', '悦', '枫', '芸', '瑗', '琰', '韵', '融', '园', '艺', '咏', '卿', '澜', '青', '倩', '婷', '姣', '婉', '娴', '瑾', '晓', '欢', '蓉', '眉', '君', '琴', '纨', '仪', '丹', '蕊', '薇', '菁', '梦', '瑶', '怡', '婵', '霭', '凝', '菲']

    for i in range(num):
        str_first = random.choice(list_f_name)
        for _ in range(random.randint(1,2)):
            str_first += random.choice(list_l_name)
        yield str_first


if __name__ == '__main__':
    for name in create_name(20):
        print(name)



